# Relational SQL Notes: Tables
REDUNDANCY | CREATE | ALTER | INSERT

In [3]:
reload_ext sql

In [4]:
%%sql
postgresql://localhost/uni_data

'Connected: @uni_data'

____

## 0. Redundancy in Table
- Achim Conzelmann ins listed twice, and the only difference is in the organisation and organisation sector
- We can see that for each entry we have The Professors, Their Univeristy info,  and their affiliations
- Their afficiations contaan their funtion and the organisation name and sector
- So instead of having one table(entity) withall this info. it is better to split it up into more tables to abiud redundancy
    - Professors table to hold the names and univerisyt short code
    - Universities table to hold the UNiversity names, city and short code
    - Affiliations table to hols professors names and their multiple affiliations (Universities, Organisations and their functions at these organisations)
    - Organisations table to hold heach organisation and their sector

In [9]:
%%sql
SELECT * FROM uni_profs
LIMIT 3;

 * postgresql://localhost/uni_data
3 rows affected.

[(1, 'Achim', 'Conzelmann', 'Uni Bern', 'UBE', 'Bern', 'NA', 'PH Bern, Schulrat', 'Education & research'),
 (2, 'Achim', 'Conzelmann', 'Uni Bern', 'UBE', 'Bern', 'NA', 'Foundation of Talents', 'Society, Social, Culture & Sports'),
 (3, 'Adrian', 'Vatter', 'Uni Bern', 'UBE', 'Bern', 'NA', 'Büro Vatter AG', 'Consulting, public relations, legal & trust')]

## 1. Create Table
-  To create a table you need to specify the column names and their data types
- Data types 
    - text, numeric, char(no of string characters)

### 1.1. Create Professors table

In [51]:
%%sql
CREATE TABLE professors (
    firstname text,
    lastname text
);

SELECT * FROM professors

 * postgresql://localhost/uni_data
Done.
0 rows affected.

[]

### 1.2. Create Universities Table

In [25]:
%%sql
CREATE TABLE universities (
    university_shortname text,
    university text,
    university_city text
);

SELECT * FROM universities;

 * postgresql://localhost/uni_data
Done.
0 rows affected.

[]

### 1.3. Create Organisations Table

In [74]:
%%sql
CREATE TABLE organisations (
    organisation text,
    organisation_sector text
);

SELECT * FROM organisations;

 * postgresql://localhost/uni_data
Done.
0 rows affected.

[]

### 1.4. Create Affiliations Table

In [57]:
%%sql
CREATE TABLE affiliations (
    firstname text,
    lastname text,
    university_shortname text,
    organization text,
    function text
);

SELECT * FROM affiliations;

 * postgresql://localhost/uni_data
Done.
0 rows affected.

[]

_____

## 2. Alter Table

### 2.1. Add Column
- Add university_shortname column to the professors table

>`ALTER TABLE table_name
ADD COLUMN column_name data_type;`

In [52]:
%%sql

ALTER TABLE professors
ADD COLUMN university_shortname text;

SELECT * FROM professors;

 * postgresql://localhost/uni_data
Done.
0 rows affected.

[]

### 2.2. Rename Column
Rename organization to organisation in affiliations
> `ALTER TABLE table_name
RENAME COLUMN old_name TO new_name;`

In [58]:
%%sql

ALTER TABLE affiliations
RENAME COLUMN organization to organisation;


SELECT * FROM affiliations;

 * postgresql://localhost/uni_data
Done.
0 rows affected.

[]

### 2.2. Delete Column
Delete the university_shortname columns from affiliations
 - Because the first name and last name is sufficient to identify all professors
 - There are no two prefessors with the same name (SEE ONENOTE)
> `ALTER TABLE table_name
DROP COLUMN column_name;`

In [60]:
%%sql

ALTER TABLE affiliations
DROP COLUMN university_shortname;


SELECT * FROM affiliations;

 * postgresql://localhost/uni_data
Done.
0 rows affected.

[]

### 2.4. Delete table
>`DROP TABLE table_name;`

___

## 3. Updating Database
- Inserting Distinct records/data into tables

#### - INTO Professors

In [64]:
#DO NOT RUN AGAIN. TO AVOID DUPLICATES (uncomment if never run before)
%%sql
--DO NOT RUN AGAIN

--INSERT INTO professors
--SELECT DISTINCT first_name, last_name, uni_shortname
--FROM uni_profs;

 * postgresql://localhost/uni_data
548 rows affected.

[]

In [65]:
%%sql
SELECT * FROM professors
LIMIT 1;

 * postgresql://localhost/uni_data
1 rows affected.

[('Michel', 'Rappaz', 'EPF')]

#### - INTO Universities

In [66]:
#DO NOT RUN AGAIN. TO AVOID DUPLICATES (uncomment if never run before)
%%sql
--DO NOT RUN AGAIN

--INSERT INTO universities
--SELECT DISTINCT uni_shortname, uni, uni_city
--FROM uni_profs;

 * postgresql://localhost/uni_data
11 rows affected.

[]

In [67]:
%%sql
SELECT * FROM universities
LIMIT 1;

 * postgresql://localhost/uni_data
1 rows affected.

[('UGE', 'Uni Genf', 'Geneva')]

#### - INTO Affiliations

In [72]:
#DO NOT RUN AGAIN. TO AVOID DUPLICATES (uncomment if never run before)
%%sql
--DO NOT RUN AGAIN

--INSERT INTO affiliations
--SELECT DISTINCT first_name, last_name, organisation, funct
--FROM uni_profs;

 * postgresql://localhost/uni_data
1372 rows affected.

[]

In [73]:
%%sql
SELECT * FROM affiliations
LIMIT 1;

 * postgresql://localhost/uni_data
1 rows affected.

[('Ursula', 'Wolf', 'EuroPCR', 'Course Director')]

#### - INTO Organisations

In [75]:
#DO NOT RUN AGAIN. TO AVOID DUPLICATES (uncomment if never run before)
%%sql
--DO NOT RUN AGAIN
--INSERT INTO organisations
--SELECT DISTINCT organisation, org_sector
--FROM uni_profs;

 * postgresql://localhost/uni_data
1282 rows affected.

[]

In [78]:
%%sql
SELECT * FROM organisations
LIMIT 1;

 * postgresql://localhost/uni_data
1 rows affected.

[('Stiftung-Sammlung Schweizer Rechtsquellen', 'Not classifiable')]

___